#include <iostream>
#include <vector>

int знайти_перший_нуль(const std::vector<int>& масив) {
    for (int індекс = 0; індекс < масив.size(); індекс++) {
        if (масив[індекс] == 0) {
            return індекс;
        }
    }
    return -1; // Повертаємо -1 як показник відсутності нульового елемента
}

int main() {
    std::vector<int> мій_масив = {1, 2, 3, 0, 5, 6}; // Зразок масиву, який можна змінити

    int індекс_нуля = знайти_перший_нуль(мій_масив);
    if (індекс_нуля != -1) {
        std::cout << "Індекс першого нульового елемента: " << індекс_нуля << std::endl;
    } else {
        std::cout << "Масив не містить нульових елементів" << std::endl;
    }

    return 0;
}
