#include <iostream>
#include <vector>
#include <random>

int кількість_у_діапазоні(const std::vector<double>& масив, double A, double B) {
    int кількість = 0;
    for (double елемент : масив) {
        if (елемент >= A && елемент <= B) {
            кількість++;
        }
    }
    return кількість;
}

double сума_після_максимального(const std::vector<double>& масив) {
    if (масив.empty()) {
        return 0;
    }

    double максимальний = масив[0];
    int індекс_максимального = 0;

    // Знаходимо максимальний елемент та його індекс
    for (int індекс = 1; індекс < масив.size(); індекс++) {
        if (масив[індекс] > максимальний) {
            максимальний = масив[індекс];
            індекс_максимального = індекс;
        }
    }

    double сума = 0;
    // Обчислюємо суму елементів, які знаходяться після максимального
    for (int індекс = індекс_максимального + 1; індекс < масив.size(); індекс++) {
        сума += масив[індекс];
    }
    return сума;
}

int main() {
    int розмір_масиву = 300;
    double діапазон_початок = -100.0;
    double діапазон_кінець = 100.0;

    std::vector<double> мій_масив;
    мій_масив.reserve(розмір_масиву);

    // Генерація випадкових чисел в заданому діапазоні
    std::random_device rd;
    std::mt19937 gen(rd());
    std::uniform_real_distribution<> dis(діапазон_початок, діапазон_кінець);

    for (int i = 0; i < розмір_масиву; ++i) {
        мій_масив.push_back(dis(gen));
    }

    double A = -50.0;
    double B = 50.0;

    int кількість_у_діапазоні_елементів = кількість_у_діапазоні(мій_масив, A, B);
    std::cout << "Кількість елементів у діапазоні від " << A << " до " << B << ": " << кількість_у_діапазоні_елементів << std::endl;

    double сума_після_максимального_елемента = сума_після_максимального(мій_масив);
    std::cout << "Сума елементів після максимального елемента: " << сума_після_максимального_елемента << std::endl;

    return 0;
}

